; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	instrument12 - instrument
	thermograph2 - mode
	thermograph4 - mode
	thermograph0 - mode
	infrared3 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star2 - direction
	Star5 - direction
	GroundStation0 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument1 thermograph4)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star5)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 infrared3)
	(supports instrument8 thermograph0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 Star2)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument9 thermograph2)
	(supports instrument9 thermograph4)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 GroundStation1)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument10 infrared3)
	(supports instrument10 thermograph0)
	(supports instrument10 thermograph4)
	(calibration_target instrument10 Star2)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument11 thermograph4)
	(supports instrument11 thermograph2)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star5)
	(supports instrument12 thermograph2)
	(calibration_target instrument12 GroundStation0)
	(calibration_target instrument12 Star5)
	(on_board instrument11 satellite6)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star6)
)
(:goal (and
	(pointing satellite0 Star10)
	(pointing satellite1 Planet11)
	(pointing satellite2 Phenomenon9)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 GroundStation3)
	(pointing satellite6 Star2)
	(have_image Star6 thermograph0)
	(have_image Phenomenon7 spectrograph1)
	(have_image Phenomenon8 thermograph0)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph0)
	(have_image Planet11 thermograph2)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 12
2. (calibrate satellite3 instrument7 star5)
   added: (calibrated instrument7)
   goals met: 0 of 12
3. (turn_to satellite3 star10 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star10)
   goals met: 0 of 12
4. (take_image satellite3 star10 instrument7 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 1 of 12
5. (turn_to satellite3 phenomenon9 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon9)
   goals met: 1 of 12
6. (take_image satellite3 phenomenon9 instrument7 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 2 of 12
7. (turn_to satellite3 phenomenon8 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 phenomenon8)
   goals met: 2 of 12
8. (turn_to satellite2 groundstation0 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 groundstation0)
   goals met: 2 of 12
9. (turn_to satellite1 planet11 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet11)
   goals met: 3 of 12
10. (turn_to satellite0 star10 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star10)
   goals met: 4 of 12
11. (take_image satellite3 phenomenon8 instrument7 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 5 of 12
12. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 5 of 12
13. (calibrate satellite2 instrument4 groundstation0)
   added: (calibrated instrument4)
   goals met: 5 of 12
14. (turn_to satellite2 phenomenon7 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 phenomenon7)
   goals met: 5 of 12
15. (take_image satellite2 phenomenon7 instrument4 spectrograph1)
   added: (have_image phenomenon7 spectrograph1)
   goals met: 6 of 12
16. (turn_to satellite2 planet11 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 planet11)
   goals met: 6 of 12
17. (take_image satellite2 planet11 instrument4 thermograph2)
   added: (have_image planet11 thermograph2)
   goals met: 7 of 12
18. (turn_to satellite2 phenomenon9 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon9)
   goals met: 8 of 12
19. (turn_to satellite3 star6 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star6)
   goals met: 8 of 12
20. (take_image satellite3 star6 instrument7 thermograph0)
   added: (have_image star6 thermograph0)
   goals met: 9 of 12
21. (turn_to satellite3 groundstation0 star6)
   deleted: (pointing satellite3 star6)
   added: (pointing satellite3 groundstation0)
   goals met: 10 of 12
22. (turn_to satellite4 groundstation3 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 groundstation3)
   goals met: 11 of 12
23. (turn_to satellite6 star2 star6)
   deleted: (pointing satellite6 star6)
   added: (pointing satellite6 star2)
   goals met: 12 of 12
